package java_may_13;

public class Main {
    public static void main(String[] args) {
        Site site = new Site();

    }
}
//    амовник хоче отримати сайт для розмішення постів. Пости розміщуються
//    звичайними юзерами.
//        Пости поділяются на два типи:
//        ті хто шукає роботу
//        ті хто пропонує роботу
//        Поля постів:
//        Заголовок
//        опис
//        країна(роботи)
//        місто(роботи)
//        телефон
//        ім'я автора поста
//        один автор може розмітити багато різних типів постів.
//        Створити меню:
//        - створити пост
//        - переглянути всі пости
//        - переглянути пости по пипах

//        - видалити пост
//        - знайти пост певного типу в певному місті