package java_may_06._1;

public class Main {

    public static void main(String []args) {
        Person person1 = new Person(
                "Ivan",
                "Petrov",
                15,
                "www.site.ua",
                "Barsik", 10
        );
        person1.makeNoise();
        person1.log("admin","admin");

    }
}
//1. Стоврити класс Персона, та Тваринка
//        В Персона є тваринка.
//        У персона є ім'я, прізвище, вік, Пошта.
//        В тваринки є клічка, вік.
//        Пошта - сайт , логін, пароль
//        Поведінка.
//        Тварини -  Гавкати. Пісяти(усюди)
//        Пошти - логінитись (логін, пароль) => Ви залогінені
//
//        2. Компанія.
//        назва
//        Департаменти []
//        назва
//        Працівників []
//        ім'я
//        прізвище
//        стаж
//        посаду
//        3. Зявка
//        номер
//        дату
//        Тип(enum?)
//        Клієнат
//        прізвище
//        ім'я
//        дату народження
//        Паспорт
//        серію
//        номер
//        ким виданий
//
//        Створити класс попелющка ім'я вік розмір ноги Принц(пустий до певного часу)
//        створити кілька попелюшок, покласти їх в масив
//        Створити класс принц  з полем туфелька
//        створити 1 об'єкт принца в якого э туфелька
//        поєднати відповідну попелюшку з відповідним принцом